In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\priya\anaconda3\lib\site-packages (8.0.29)
Requirement already satisfied: protobuf>=3.0.0 in c:\users\priya\anaconda3\lib\site-packages (from mysql-connector-python) (4.21.1)

In [2]:
#import libraries
import mysql.connector as connection

In [3]:
def create_database(name):
    '''create database
       name:str
           str to create database
    '''
    try:
        # query for creating the database
        query='create database '+name
        # use my_connection() to get database connection
        conn = connection.connect(host='localhost',user='root',password='mysql',use_pure=True)
        # cursor for database
        my_cursor = conn.cursor()
        my_cursor.execute(query)
        return 'database '+ name +' created successfully'
    except Exception as e:
        print(str(e))
        print('Database '+name+' already exist')

In [4]:
def my_connection(db_name):
    '''create connection with database'''
    try:
        mydb = connection.connect(host='localhost',user='root',password='mysql',database = db_name,use_pure=True)
        return mydb
    except Exception as e:
        print(str(e))

In [5]:
create_database('inventory')

'database inventory created successfully'

#### 1.create a table attribute and dress dataset

In [6]:
def CreateTable(database_name,query):
    '''Create table inside existing database
       Parameters
       ------------
       database_name: str
           give the name of existing database
       query: str
           write a query to create table
    '''
    try:
        # connection for database
        conn=my_connection(database_name)
        # cursor for database
        my_cursor = conn.cursor()
        #Query for Creating the table
        query1 = query
        my_cursor.execute(query1)
        print("Table is Created in the Database")
        return
    except Exception as e:
        print(str(e))

In [7]:
#query for Attribute dataset
query="CREATE TABLE Attribute_Table(Dress_ID int,Style VARCHAR(30),Price VARCHAR(30),Rating decimal(2,1),Size VARCHAR(30),Season VARCHAR(30),NeckLine VARCHAR(30),SleeveLength VARCHAR(30),waiseline VARCHAR(30),Material VARCHAR(30),FabricType VARCHAR(30),Decoration VARCHAR(30),PatternType VARCHAR(30),Recommendation BOOLEAN)"

In [8]:
#query for Dress sales dataset
query1 = """CREATE TABLE Dress_sales(Dress_ID int,
            `29/8/2013` int , 
            `31/8/2013` int , 
            `2/9/2013` int ,
            `4/9/2013` int ,
            `6/9/2013` int,
            `8/9/2013` int,
            `10/9/2013` int , 
            `12/9/2013` int ,
            `14/9/2013` int , 
            `16/9/2013` int , 
            `18/9/2013` int , 
            `20/9/2013` int , 
            `22/9/2013` int ,
            `24/9/2013` int ,
            `26/9/2013` int ,
            `28/9/2013` int ,
            `30/9/2013` int ,
            `2/10/2013` int ,
            `4/10/2013` int ,
            `6/10/2013` int ,
            `8/10/2013` int ,
            `10/10/2013` int ,
            `12/10/2013` int
            )"""

In [9]:
CreateTable('inventory',query)

Table is Created in the Database

In [10]:
CreateTable('inventory',query1)

Table is Created in the Database

#### 2. Do a bulk load for these two tables

In [14]:
import csv
def insert_data(database_name,path,query):
    '''
    insert data into database
    Parameters:
    database_name:str
        give the database name
    path:str
        give the full path of csv file
    query:str
        insert query for inserting data into mysql
    '''
    try:
        # connection for database
        conn=my_connection(database_name)
        # cursor for database
        my_cursor = conn.cursor()
        file = open(path)
        csv_data = csv.reader(file)
        #print(csv_data)
        skipHeader = True
        for row in csv_data:
            #print(row[1])
            if skipHeader:
                skipHeader = False
                continue
            my_cursor.execute(query, row)
            #print(row)
            conn.commit()
        print("Data inserted successfully")
        return
    except Exception as e:
        print(str(e))

In [12]:
insert_query=("INSERT INTO attribute_table(Dress_ID ,Style ,Price ,Rating, Size ,Season ,NeckLine ,SleeveLength ,waiseline ,Material ,FabricType ,Decoration ,PatternType ,Recommendation)" "VALUES(%s, %s, %s, %s, %s,%s, %s, %s, %s, %s,%s, %s, %s, %s)")

In [15]:
insert_data('inventory','Attributes.csv',insert_query)

Data inserted successfully

In [16]:
# #Insert sales records from sql database
SET sql_mode = "";
LOAD DATA INFILE 'C:/ProgramData/MySQL/MySQL Server 8.0/Test/Dress Sales.csv' INTO TABLE dress_sales
FIELDS TERMINATED BY ','
ENCLOSED BY '"'
LINES TERMINATED BY '\r\n'
IGNORE 1 LINES;
#select statement to see the data
select * from dress_sales

#### 3. Read these datasets in pandas from sql

In [17]:
import pandas as pd
conn=my_connection('inventory')
df1 = pd.read_sql('select * from attribute_table',conn)
df1.head(2)

,Dress_ID,Style,Price,Rating,Size,Season,NeckLine,SleeveLength,waiseline,Material,FabricType,Decoration,PatternType,Recommendation
0,1006032852,Sexy,Low,4.6,M,Summer,o-neck,sleevless,empire,,chiffon,ruffles,animal,1
1,1212192089,Casual,Low,0.0,L,Summer,o-neck,Petal,natural,microfiber,,ruffles,animal,0

In [18]:
df2 = pd.read_sql('select * from dress_sales',conn)
df2.head(2)

,Dress_ID,29/8/2013,31/8/2013,2/9/2013,4/9/2013,6/9/2013,8/9/2013,10/9/2013,12/9/2013,14/9/2013,...,24/9/2013,26/9/2013,28/9/2013,30/9/2013,2/10/2013,4/10/2013,6/10/2013,8/10/2013,10/10/2013,12/10/2013
0,1006032852,2114,2274,2491,2660,2727,2887,2930,3119,3204,...,3554,3624,3706,3746,3795,3832,3897,3923,3985,4048
1,1212192089,151,275,570,750,813,1066,1164,1558,1756,...,2710,2942,3258,3354,3475,3654,3911,4024,4125,4277

#### 4. Convert attribute dataset in json format

In [19]:
df_json = df1.to_json('attribute_data.json')

#### 5. Store this json dataset in mongodb

In [20]:
import pymongo as pymongo
import json

client = pymongo.MongoClient("mongodb+srv://ineuron:Priya1803@cluster0.rxtbh.mongodb.net/?retryWrites=true&w=majority")
db = client.test
print(db)
db1 = client['inventory']
coll = db1['test']
with open('attribute_data.json') as f1:
    json_data = json.load(f1)
if isinstance(json_data, list):
    coll.insert_many(json_data)
else:
    coll.insert_one(json_data)

#### 6. In sql task try to perform left join operation with attribute and dress dataset

In [21]:
#left join using pandas
df = pd.merge(df1,df2,how='left',on='Dress_ID')
df.head(2)

,Dress_ID,Style,Price,Rating,Size,Season,NeckLine,SleeveLength,waiseline,Material,...,24/9/2013,26/9/2013,28/9/2013,30/9/2013,2/10/2013,4/10/2013,6/10/2013,8/10/2013,10/10/2013,12/10/2013
0,1006032852,Sexy,Low,4.6,M,Summer,o-neck,sleevless,empire,,...,3554,3624,3706,3746,3795,3832,3897,3923,3985,4048
1,1212192089,Casual,Low,0.0,L,Summer,o-neck,Petal,natural,microfiber,...,2710,2942,3258,3354,3475,3654,3911,4024,4125,4277

#### 7. Write a sql query to find out how many unique dress that we have based on dress id

In [23]:
conn=my_connection('inventory')
cursor = conn.cursor()
cursor.execute("select count(distinct(dress_id)) from attribute_table")
for i in cursor.fetchall():
  print(i)
# by using pandas
len(set(list(df['Dress_ID'])))

(475,)

475

#### 8.Try to find how many dress is having recommendation 0

In [24]:
df1=df.loc[df['Recommendation']==0]
df1.shape

(319, 37)

#### 9. Try to find out total dress sell for individual dress id

In [25]:
df['Sales'] = df[['29/8/2013', '31/8/2013', '2/9/2013','4/9/2013','6/9/2013','8/9/2013','10/9/2013',
                                        '12/9/2013','14/9/2013','16/9/2013','18/9/2013','20/9/2013','22/9/2013','24/9/2013'
                                        ,'26/9/2013','28/9/2013','30/9/2013','2/10/2013','4/10/2013','6/10/2013',
                                        '8/10/2013','10/10/2013','12/10/2013']].agg('sum', axis=1)
df_sales=df.groupby('Dress_ID')['Sales'].sum()
df_sales

Dress_ID
444282011      1732
510519284      2888
511503677     12149
520233308     11041
522776523      9414
              ...
1246749980     6915
1246945687     1034
1249825438     1814
1250787559       40
1253973206     2231
Name: Sales, Length: 475, dtype: int64

#### 10. Try to find out third highest most selling dress id

In [26]:
sales_data = df.groupby('Dress_ID')['Sales'].sum()
df_sales=pd.DataFrame(sales_data)
largest=[df_sales['Sales'].nlargest(3)]
largest

[Dress_ID
 629131530    155927
 735635595     91556
 793162246     88426
 Name: Sales, dtype: int64]